{
  "apple": "Calories: 52 kcal per 100g. Rich in dietary fiber, vitamin C, and antioxidants. Supports heart health and aids digestion.",
  "banana": "Calories: 96 kcal per 100g. Excellent source of potassium, vitamin B6, and fiber. Supports heart health and energy levels.",
  "beetroot": "Calories: 43 kcal per 100g. High in folate, manganese, and nitrates. Improves blood flow and supports liver detoxification.",
  "bell pepper": "Calories: 31 kcal per 100g. Rich in vitamins A, C, and antioxidants. Boosts immunity and eye health.",
  "cabbage": "Calories: 25 kcal per 100g. Contains vitamin K, vitamin C, and fiber. Supports digestion and has anti-inflammatory properties.",
  "capsicum": "Calories: 31 kcal per 100g. High in vitamin C and antioxidants. Enhances immune function and skin health.",
  "carrot": "Calories: 41 kcal per 100g. Rich in beta-carotene, fiber, and vitamin K. Supports vision and skin health.",
  "cauliflower": "Calories: 25 kcal per 100g. High in vitamin C, K, and fiber. Supports digestion and has anti-inflammatory benefits.",
  "chilli pepper": "Calories: 40 kcal per 100g. Contains capsaicin, vitamin C, and antioxidants. Boosts metabolism and heart health.",
  "corn": "Calories: 86 kcal per 100g. Source of fiber, vitamin B, and antioxidants. Supports digestion and energy production.",
  "cucumber": "Calories: 16 kcal per 100g. High water content, vitamin K, and antioxidants. Promotes hydration and skin health.",
  "eggplant": "Calories: 25 kcal per 100g. Contains fiber, antioxidants, and vitamins B1, B6. Supports heart health and digestion.",
  "garlic": "Calories: 149 kcal per 100g. Rich in allicin, antioxidants, and vitamin C. Boosts immunity and cardiovascular health.",
  "ginger": "Calories: 80 kcal per 100g. Contains gingerol and antioxidants. Aids digestion, reduces inflammation, and relieves nausea.",
  "grapes": "Calories: 69 kcal per 100g. Rich in vitamins C, K, and antioxidants. Supports heart health and reduces oxidative stress.",
  "jalepeno": "Calories: 29 kcal per 100g. Contains capsaicin, vitamin C, and antioxidants. Boosts metabolism and immunity.",
  "kiwi": "Calories: 61 kcal per 100g. High in vitamin C, fiber, and antioxidants. Supports immunity and digestion.",
  "lemon": "Calories: 29 kcal per 100g. Rich in vitamin C and antioxidants. Enhances immunity and aids digestion.",
  "lettuce": "Calories: 15 kcal per 100g. Contains vitamin A, K, and fiber. Supports eye health and hydration.",
  "mango": "Calories: 60 kcal per 100g. Rich in vitamins A, C, and fiber. Supports immunity and digestion.",
  "onion": "Calories: 40 kcal per 100g. Contains quercetin and sulfur compounds. Promotes heart health and immunity.",
  "orange": "Calories: 47 kcal per 100g. High in vitamin C and antioxidants. Boosts immunity and skin health.",
  "paprika": "Calories: 282 kcal per 100g. Rich in vitamin A, C, and antioxidants. Enhances immunity and metabolism.",
  "pear": "Calories: 57 kcal per 100g. Contains fiber, vitamin C, and antioxidants. Supports digestion and heart health.",
  "peas": "Calories: 81 kcal per 100g. High in fiber, protein, vitamin C, and K. Supports digestion and bone health.",
  "pineapple": "Calories: 50 kcal per 100g. Rich in vitamin C, manganese, and bromelain. Aids digestion and immunity.",
  "pomegranate": "Calories: 83 kcal per 100g. Contains antioxidants, vitamin C, and fiber. Supports heart health and reduces inflammation.",
  "potato": "Calories: 77 kcal per 100g. High in potassium, vitamin C, and fiber. Supports energy and digestive health.",
  "raddish": "Calories: 16 kcal per 100g. Contains vitamin C, fiber, and antioxidants. Supports digestion and detoxification.",
  "soy beans": "Calories: 147 kcal per 100g. Rich in protein, fiber, and isoflavones. Supports heart health and muscle growth.",
  "spinach": "Calories: 23 kcal per 100g. High in iron, vitamin K, C, and antioxidants. Supports bone health and immunity.",
  "sweetcorn": "Calories: 86 kcal per 100g. Contains fiber, vitamin B, and antioxidants. Supports digestion and energy metabolism.",
  "sweetpotato": "Calories: 86 kcal per 100g. Rich in beta-carotene, fiber, and vitamin C. Supports vision, immunity, and digestion.",
  "tomato": "Calories: 18 kcal per 100g. High in vitamin C, lycopene, and antioxidants. Promotes heart health and reduces inflammation.",
  "turnip": "Calories: 28 kcal per 100g. Contains vitamin C, fiber, and antioxidants. Supports digestion and immunity.",
  "watermelon": "Calories: 30 kcal per 100g. High water content, vitamin C, and antioxidants. Promotes hydration and heart health."
}
